Menggunkan Library Pandas

In [1]:
import pandas as pd

In [ ]:
data = {
    'tanggal': [
        '2024-01-01', '2024-01-01',
        '2024-01-02', '2024-01-02',
        '2024-02-01', '2024-02-01',
        '2024-03-01', '2024-03-01'
    ],
    'produk': [
        'Buku', 'Pulpen',
        'Buku', 'Penghapus',
        'Pulpen', 'Buku',
        'Buku', 'Pulpen'
    ],
    'kategori': [
        'ATK', 'ATK', 'ATK', 'ATK',
        'ATK', 'ATK', 'ATK', 'ATK'
    ],
    'harga': [
        10000, 3000, 10000, 2000,
        3000, 10000, 10000, 3000
    ],
    'jumlah': [
        2, 5, 1, 3, 4, 2, 5, 6
    ]
}

df = pd.DataFrame(data)
df['tanggal'] = pd.to_datetime(df['tanggal'])
df

     tanggal     produk kategori  harga  jumlah
0 2024-01-01       Buku      ATK  10000       2
1 2024-01-01     Pulpen      ATK   3000       5
2 2024-01-02       Buku      ATK  10000       1
3 2024-01-02  Penghapus      ATK   2000       3
4 2024-02-01     Pulpen      ATK   3000       4
5 2024-02-01       Buku      ATK  10000       2
6 2024-03-01       Buku      ATK  10000       5
7 2024-03-01     Pulpen      ATK   3000       6

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   tanggal   8 non-null      datetime64[ns]
 1   produk    8 non-null      object
 2   kategori  8 non-null      object
 3   harga     8 non-null      int64
 4   jumlah    8 non-null      int64
dtypes: datetime64[ns](1), int64(2), object(2)
memory usage: 452.0+ bytes

In [21]:
df.describe()

                   tanggal         harga    jumlah  total_penjualan     bulan
count                    8      8.000000  8.000000         8.000000  8.000000
mean   2024-01-24 00:00:00   6375.000000  3.500000     18875.000000  1.750000
min    2024-01-01 00:00:00   2000.000000  1.000000      6000.000000  1.000000
25%    2024-01-01 18:00:00   3000.000000  2.000000     11500.000000  1.000000
50%    2024-01-17 00:00:00   6500.000000  3.500000     16500.000000  1.500000
75%    2024-02-08 06:00:00  10000.000000  5.000000     20000.000000  2.250000
max    2024-03-01 00:00:00  10000.000000  6.000000     50000.000000  3.000000
std                    NaN   3889.087297  1.772811     13516.524279  0.886405

In [7]:
df.isna().sum()

tanggal     0
produk      0
kategori    0
harga       0
jumlah      0
dtype: int64

In [13]:
df["total_penjualan"] = df["harga"] * df["jumlah"]
df["bulan"] = df["tanggal"].dt.month

In [14]:
df["total_penjualan"].sum()

np.int64(151000)

In [22]:
df.groupby("produk") ["total_penjualan"].sum()

produk
Buku         100000
Penghapus      6000
Pulpen        45000
Name: total_penjualan, dtype: int64

In [15]:
df.groupby("produk") ["jumlah"].sum().sort_values(ascending=False)

produk
Pulpen       15
Buku         10
Penghapus     3
Name: jumlah, dtype: int64

In [17]:
df.groupby("bulan") ["total_penjualan"].sum()

bulan
1    51000
2    32000
3    68000
Name: total_penjualan, dtype: int64

In [19]:
df.groupby("produk") ["total_penjualan"].sum().sort_values(ascending=False)

produk
Buku         100000
Pulpen        45000
Penghapus      6000
Name: total_penjualan, dtype: int64

In [20]:
ranking = (
    df.groupby("produk") ["total_penjualan"]
    .sum()
    .rank(ascending=False, method="dense")
)
ranking

produk
Buku         1.0
Penghapus    3.0
Pulpen       2.0
Name: total_penjualan, dtype: float64

In [25]:
laporan = (
    df.groupby(["bulan", "produk"])
    .agg(
        total_jumlah= ("jumlah", "sum"),
        total_penjumlahan=("total_penjualan", "sum")
    )
    .reset_index()
    )